#+title: Simply Annotate: Simple Annotation
#+author: James Dyer
#+email: captainflasmr@gmail.com
#+language: en
#+options: ':t toc:nil author:nil email:nil num:nil title:nil
#+todo: TODO DOING | DONE
#+startup: showall

Added texinfo documentation for future automatic installation through MELPA and created an Emacs manual.

If you want to see what the manual would look like, just download the docs directory from github, cd into it, and run:

#+begin_src bash
make
sudo make install-docs
#+end_src

#+RESULTS:
: make: Nothing to be done for 'docs'.

Then calling up =info= =C-h i= and Simply Annotate will be present in the Emacs menu, or just select =m= and search for =Simply Annotate=

For those interested in the manual, I have converted it into html format, which is accessible here:

[[file:docs/simply-annotate.org]]

It has been converted using the following command:

#+begin_src bash
makeinfo --html --no-split simply-annotate.texi -o simply-annotate.html
pandoc -f html -t org -o simply-annotate.org simply-annotate.html
#+end_src

#+RESULTS:
